Repository: m0b-x/gym-notes-track-app
Catalog: frontend/gym_notes_track_app/lib/l10n/app_*.arb
Languages: ro

source: Folders
ro: Foldere

source: Notes
ro: Notițe

source: Create Folder
ro: Crează Folder

source: Create Note
ro: Crează Notiță

source: Folder Name
ro: Nume Folder

source: Note Name
ro: Nume Notiță

source: Cancel
ro: Anulează

source: Create
ro: Crează

source: Edit
ro: Editează

source: Delete
ro: Șterge

source: Save
ro: Salvează

source: Search
ro: Caută

# error
source: Error: {message}
ro: Eroare: {message}

# created
source: Created: {date}
ro: Creat: {date}

# updated
source: Updated: {date}
ro: Actualizat: {date}

source: Delete Folder
ro: Șterge Folder

# deleteFolderConfirm
source: Are you sure you want to delete "{name}"?
ro: Ești sigur că vrei să ștergi "{name}"?

# deleteFolderWithNotesConfirm
source: Are you sure you want to delete "{name}"? This will also delete {count} note(s).
ro: Ești sigur că vrei să ștergi "{name}"? Aceasta va șterge și {count} notiță(e).

source: Rename
ro: Redenumește

source: Rename Folder
ro: Redenumește Folder

source: Untitled Note
ro: Notiță fără titlu

source: Empty note
ro: Notiță goală

source: Delete Note
ro: Șterge Notiță

# deleteNoteConfirm
source: Are you sure you want to delete "{title}"?
ro: Ești sigur că vrei să ștergi "{title}"?

# deleteThisNote
source: this note
ro: această notiță

source: Enter folder name
ro: Introdu numele folderului

source: New Note
ro: Notiță Nouă

source: Switch to Edit mode
ro: Comută la modul Editare

source: Preview markdown
ro: Previzualizare markdown

source: Preview
ro: Previzualizare

# autoSaveOn
source: Auto-save is ON (saves every 5s after changes)
ro: Auto-salvare ACTIVATĂ (salvează la fiecare 5s după modificări)

source: Enable auto-save
ro: Activează auto-salvarea

source: Auto-save OFF
ro: Auto-salvare DEZACTIVATĂ

source: Save note
ro: Salvează notița

source: *No content yet*
ro: *Fără conținut încă*

# startWriting
source: Start writing your first note...
ro: Începe să scrii prima ta notiță...

source: Note cannot be empty
ro: Notița nu poate fi goală

source: Note saved!
ro: Notiță salvată!

source: Edit Title
ro: Editează Titlu

source: Enter note title
ro: Introdu titlul notiței

source: Auto-save enabled
ro: Auto-salvare activată

source: Auto-save disabled
ro: Auto-salvare dezactivată

source: Markdown Shortcuts
ro: Comenzi Rapide Markdown

# markdownShortcutsDesc
source: Customize toolbar buttons and actions
ro: Personalizează butoanele și acțiunile din bara de instrumente

source: Reset to Default
ro: Resetează la Implicit

source: Remove All Custom
ro: Elimină Toate Personalizate

source: No custom shortcuts yet
ro: Nicio comandă rapidă personalizată încă

# tapToAddShortcut
source: Tap the + button to add one
ro: Apasă butonul + pentru a adăuga una

source: Delete Shortcut
ro: Șterge Comanda Rapidă

# deleteShortcutConfirm
source: Are you sure you want to delete this shortcut?
ro: Ești sigur că vrei să ștergi această comandă rapidă?

# resetDialogTitle
source: Reset to Default
ro: Resetează la Implicit

# resetDialogMessage
source: This will restore all default shortcuts to their original order and settings. Custom shortcuts will be kept but moved to the end.
ro: Aceasta va restabili toate comenzile rapide implicite la ordinea și setările originale. Comenzile rapide personalizate vor fi păstrate dar mutate la sfârșit.

source: Reset
ro: Resetează

# removeCustomDialogTitle
source: Remove All Custom
ro: Elimină Toate Personalizate

# removeCustomDialogMessage
source: This will permanently delete all custom shortcuts you created. Default shortcuts will remain.
ro: Aceasta va șterge permanent toate comenzile rapide personalizate pe care le-ai creat. Comenzile rapide implicite vor rămâne.

source: Remove
ro: Elimină

# defaultLabel
source: DEFAULT
ro: IMPLICIT

source: Inserts current date
ro: Inserează data curentă

# opensHeaderMenu
source: Opens header menu (H1-H6)
ro: Deschide meniul de anteturi (H1-H6)

# beforeAfterText
source: Before: "{before}" | After: "{after}"
ro: Înainte: "{before}" | După: "{after}"

source: Hide
ro: Ascunde

source: Show
ro: Arată

source: New Shortcut
ro: Comandă Rapidă Nouă

source: Edit Shortcut
ro: Editează Comanda Rapidă

source: Icon
ro: Pictogramă

source: Tap to change icon
ro: Apasă pentru a schimba pictograma

source: Select Icon
ro: Selectează Pictograma

source: Label
ro: Etichetă

# labelHint
source: e.g., Highlight
ro: ex., Evidențiere

source: Insert Type
ro: Tip Inserare

source: Wrap Selected Text
ro: Înconjoară Textul Selectat

source: Insert Current Date
ro: Inserează Data Curentă

# beforeDate
source: Before Date (optional)
ro: Înainte de Dată (opțional)

source: Markdown Start
ro: Început Markdown

# markdownStartHint
source: e.g., ==
ro: ex., ==

source: Optional text before date
ro: Text opțional înainte de dată

# afterDate
source: After Date (optional)
ro: După Dată (opțional)

source: Markdown End
ro: Sfârșit Markdown

source: Optional text after date
ro: Text opțional după dată

source: Label cannot be empty
ro: Eticheta nu poate fi goală

source: Bold
ro: Îngroșat

source: Headers
ro: Anteturi

source: Point List
ro: Listă cu Puncte

source: Strikethrough
ro: Tăiat

source: Bullet List
ro: Listă cu Buline

source: Numbered List
ro: Listă Numerotată

source: Checkbox
ro: Casetă de Bifat

source: Quote
ro: Citat

source: Inline Code
ro: Cod în Linie

source: Code Block
ro: Bloc de Cod

source: Current Date
ro: Data Curentă

source: Header 1
ro: Antet 1

source: Header 2
ro: Antet 2

source: Header 3
ro: Antet 3

source: Header 4
ro: Antet 4

source: Header 5
ro: Antet 5

source: Header 6
ro: Antet 6

source: Undo
ro: Anulează

source: Redo
ro: Refă

source: Decrease Font Size
ro: Micșorează Fontul

source: Increase Font Size
ro: Mărește Fontul

source: Settings
ro: Setări

source: Drop position
ro: Poziție de plasare

source: Long press to reorder
ro: Apasă lung pentru a reordona

# shortcutButton
source: {label} button
ro: Buton {label}

# markdownSpaceWarning
source: Tip: Add a space after markdown syntax (e.g., '# ' or '- ') for proper formatting.
ro: Sfat: Adaugă un spațiu după sintaxa markdown (ex., '# ' sau '- ') pentru formatare corectă.

source: Reorder shortcuts
ro: Reordonează comenzile rapide

# doneReordering
source: Done
ro: Gata

# noSearchResults
source: No results found
ro: Niciun rezultat găsit

# searchHint
source: Type to search notes
ro: Tastează pentru a căuta notițe

source: Loading more...
ro: Se încarcă mai multe...

source: No more notes
ro: Nu mai sunt notițe

source: Sort by
ro: Sortează după

# sortByUpdated
source: Last updated
ro: Ultima actualizare

# sortByCreated
source: Date created
ro: Data creării

# sortByTitle
source: Title
ro: Titlu

source: Ascending
ro: Crescător

source: Descending
ro: Descrescător

source: Loading content...
ro: Se încarcă conținutul...

# largeNoteWarning
source: This note is very large and may take a moment to load
ro: Această notiță este foarte mare și poate dura un moment să se încarce

# noteStats
source: {count} distinct characters, {chunks} chunks
ro: {count} caractere distincte, {chunks} fragmente

# compressedNote
source: Compressed
ro: Comprimat

# searchInFolder
source: Search in this folder
ro: Caută în acest folder

# searchAll
source: Search all notes
ro: Caută în toate notițele

source: Recent searches
ro: Căutări recente

source: Clear search history
ro: Șterge istoricul căutărilor

source: Filter by date
ro: Filtrează după dată

# fromDate
source: From
ro: De la

# toDate
source: To
ro: Până la

source: Apply filter
ro: Aplică filtru

source: Clear filter
ro: Șterge filtru

# matchesFound
source: {count} matches found
ro: {count} potriviri găsite

source: Auto-saving...
ro: Se salvează automat...

source: Changes saved
ro: Modificări salvate

source: Unsaved changes
ro: Modificări nesalvate

source: Discard changes
ro: Renunță la modificări

source: Keep editing
ro: Continuă editarea

# virtualScrollEnabled
source: Virtual scroll enabled for large content
ro: Derulare virtuală activată pentru conținut mare

# lineCount
source: {count} lines
ro: {count} linii

# emptyFoldersHint
source: Looks like you might want to create a folder
ro: Se pare că ai putea dori să creezi un folder

# emptyNotesHint
source: Write your first note
ro: Scrie prima ta notiță

# tapPlusToCreate
source: Tap + to get started
ro: Apasă + pentru a începe

# charactersCount
source: {current}/{max} characters
ro: {current}/{max} caractere

# databaseSettings
source: Database
ro: Bază de Date

# databaseSettingsDesc
source: Manage database location and storage
ro: Gestionează locația și stocarea bazei de date

source: About
ro: Despre

source: Database Location
ro: Locația Bazei de Date

source: Copy Path
ro: Copiază Calea

# openInFinder
source: Open Folder
ro: Deschide Folderul

# databaseStats
source: Statistics
ro: Statistici

source: Size
ro: Dimensiune

source: Last Modified
ro: Ultima Modificare

source: Maintenance
ro: Întreținere

# maintenanceDesc
source: Run SQLite VACUUM to reclaim unused space from deleted notes and folders. This rebuilds the database file, defragments the data, and can significantly reduce file size after deleting large amounts of content. The operation may take a few seconds depending on database size.
ro: Rulează SQLite VACUUM pentru a recupera spațiul nefolosit din notițele și folderele șterse. Aceasta reconstruiește fișierul bazei de date, defragmentează datele și poate reduce semnificativ dimensiunea fișierului după ștergerea unor cantități mari de conținut.

source: Optimize Database
ro: Optimizează Baza de Date

source: Danger Zone
ro: Zonă Periculoasă

# dangerZoneDesc
source: These actions are irreversible. All your notes and folders will be permanently deleted.
ro: Aceste acțiuni sunt ireversibile. Toate notițele și folderele tale vor fi șterse permanent.

source: Delete All Data
ro: Șterge Toate Datele

# pathCopied
source: Path copied to clipboard
ro: Calea a fost copiată în clipboard

# notSupportedOnPlatform
source: Not supported on this platform
ro: Nu este suportat pe această platformă

source: Error opening folder
ro: Eroare la deschiderea folderului

# optimizing
source: Optimizing database...
ro: Se optimizează baza de date...

# optimizationComplete
source: Database optimized successfully
ro: Baza de date a fost optimizată cu succes

source: saved
ro: salvat

# alreadyOptimized
source: database already optimized
ro: Baza de date este deja optimizată

# deleteConfirmation
source: This action cannot be undone. All your notes, folders, and data will be permanently deleted. Are you absolutely sure?
ro: Această acțiune nu poate fi anulată. Toate notițele, folderele și datele tale vor fi șterse permanent. Ești absolut sigur?

# deleteNotImplemented
source: Delete functionality not yet implemented for safety
ro: Funcția de ștergere nu este implementată încă din motive de siguranță

# deletingData
source: Deleting all data...
ro: Se șterg toate datele...

source: Data Deleted
ro: Date Șterse

source: Share Database
ro: Partajează Baza de Date

# shareDatabaseDesc
source: Export and share your database file via email, messaging apps, or cloud storage for backup purposes.
ro: Exportă și partajează fișierul bazei de date prin email, aplicații de mesagerie sau stocare cloud pentru backup.

# preparingShare
source: Preparing to share...
ro: Se pregătește partajarea...

# shareError
source: Error sharing database
ro: Eroare la partajarea bazei de date

# databaseNotFound
source: Database file not found
ro: Fișierul bazei de date nu a fost găsit

source: Rename Note
ro: Redenumește Notița

source: Enter new name
ro: Introdu noul nume

source: Reorder Mode
ro: Mod Reordonare

# dragToReorder
source: Drag items to reorder
ro: Trage elementele pentru a le reordona

# sortByCustom
source: Custom Order
ro: Ordine Personalizată

source: Quick Sort
ro: Sortare Rapidă

source: Sort Items
ro: Sortează Elementele

source: Sort Folders
ro: Sortează Folderele

source: Sort Notes
ro: Sortează Notițele

# sortByName
source: By Name
ro: După Nume

source: Move Up
ro: Mută Sus

source: Move Down
ro: Mută Jos

# controlsSettings
source: Controls
ro: Controale

# controlsSettingsDesc
source: Gestures, haptics and interactions
ro: Gesturi, feedback haptic și interacțiuni

# gesturesSection
source: Gestures
ro: Gesturi

# folderSwipeGesture
source: Swipe to open menu in folders
ro: Glisare pentru a deschide meniul în foldere

# folderSwipeGestureDesc
source: Swipe from left edge to open the navigation menu when browsing folders
ro: Glisează de la marginea stângă pentru a deschide meniul de navigare când navighezi în foldere

# noteSwipeGesture
source: Swipe to open menu in notes
ro: Glisare pentru a deschide meniul în notițe

# noteSwipeGestureDesc
source: Swipe from left edge to open the navigation menu when editing notes
ro: Glisează de la marginea stângă pentru a deschide meniul de navigare când editezi notițe

source: Haptic feedback
ro: Feedback haptic

# hapticFeedbackDesc
source: Vibrate on interactions like toggling switches
ro: Vibrează la interacțiuni precum comutarea comutatoarelor

# confirmDelete
source: Confirm before delete
ro: Confirmă înainte de ștergere

# confirmDeleteDesc
source: Show confirmation dialog before deleting notes or folders
ro: Afișează dialogul de confirmare înainte de ștergerea notițelor sau folderelor

# autoSaveSection
source: Auto-save
ro: Auto-salvare

# autoSave
source: Auto-save notes
ro: Auto-salvare notițe

# autoSaveDesc
source: Automatically save notes while editing
ro: Salvează automat notițele în timpul editării

source: Auto-save interval
ro: Interval auto-salvare

# autoSaveIntervalDesc
source: Save every {seconds} seconds
ro: Salvează la fiecare {seconds} secunde

# displaySection
source: Display
ro: Afișare

source: Show note preview
ro: Arată previzualizarea notiței

# showNotePreviewDesc
source: Display a preview of note content in the list
ro: Afișează o previzualizare a conținutului notiței în listă

source: Reset to defaults
ro: Resetează la valorile implicite

# resetToDefaultsConfirm
source: Are you sure you want to reset all settings to their default values?
ro: Ești sigur că vrei să resetezi toate setările la valorile implicite?

# settingsReset
source: Settings have been reset to defaults
ro: Setările au fost resetate la valorile implicite

source: Share Note
ro: Partajează Notița

source: Note Options
ro: Opțiuni Notiță

source: Exporting note...
ro: Se exportă notița...

# noteExportError
source: Error exporting note
ro: Eroare la exportul notiței

source: Choose Export Format
ro: Alege Formatul de Export

# exportAsText
source: Plain Text (.txt)
ro: Text Simplu (.txt)

# activeDatabaseSection
source: Active Database
ro: Baza de Date Activă

# activeDatabaseDesc
source: Select which database to use. Creating or switching databases will restart the app.
ro: Selectează ce bază de date să folosești. Crearea sau schimbarea bazelor de date va reporni aplicația.

source: Select Database
ro: Selectează Baza de Date

# currentDatabase
source: Current: {name}
ro: Curentă: {name}

source: Create New Database
ro: Crează Bază de Date Nouă

# newDatabaseName
source: Database Name
ro: Nume Bază de Date

source: Enter database name
ro: Introdu numele bazei de date

# invalidDatabaseName
source: Invalid name. Use only letters, numbers, underscores, and hyphens (max 50 characters).
ro: Nume invalid. Folosește doar litere, cifre, underscores și cratime (maxim 50 caractere).

# databaseExists
source: A database with this name already exists.
ro: O bază de date cu acest nume există deja.

source: Creating database...
ro: Se crează baza de date...

# databaseCreated
source: Database created successfully
ro: Baza de date a fost creată cu succes

source: Rename Database
ro: Redenumește Baza de Date

source: Renaming database...
ro: Se redenumește baza de date...

# databaseRenamed
source: Database renamed successfully
ro: Baza de date a fost redenumită cu succes

source: Switching database...
ro: Se schimbă baza de date...

source: Available Databases
ro: Baze de Date Disponibile

# noDatabases
source: No databases found
ro: Nicio bază de date găsită

source: Database Options
ro: Opțiuni Bază de Date

# switchTo
source: Switch to this database
ro: Comută la această bază de date

# deleteDatabaseConfirm
source: Are you sure you want to delete the database "{name}"? This action cannot be undone.
ro: Ești sigur că vrei să ștergi baza de date "{name}"? Această acțiune nu poate fi anulată.

# cannotDeleteActive
source: Cannot delete the currently active database. Please switch to another database first.
ro: Nu poți șterge baza de date activă curent. Te rugăm să comuți la altă bază de date mai întâi.

source: Database deleted
ro: Baza de date a fost ștearsă

# restartRequired
source: Restart may be required for full effect
ro: Repornirea poate fi necesară pentru efect complet

source: Find in note
ro: Găsește în notiță

source: Replace with
ro: Înlocuiește cu

# replaceOne
source: Replace
ro: Înlocuiește

# replaceAll
source: All
ro: Toate

# replacedCount
source: {count, plural, =1{Replaced 1 match} other{Replaced {count} matches}}
ro: {count, plural, =1{1 potrivire înlocuită} other{{count} potriviri înlocuite}}

source: Match case
ro: Potrivire majuscule

source: Whole word
ro: Cuvânt întreg

source: Use regex
ro: Folosește regex

# findAndReplace
source: Find & Replace
ro: Găsește și Înlocuiește

source: Options
ro: Opțiuni

source: Previous
ro: Anterior

source: Next
ro: Următor

source: Close
ro: Închide

# dateFormatSettings
source: Date Format
ro: Format Dată

# selectDateFormat
source: Choose how dates will be displayed:
ro: Alege cum vor fi afișate datele:

source: Long press to change format
ro: Apasă lung pentru a schimba formatul

# languageSettings
source: Language
ro: Limbă

# languageSettingsDesc
source: Change app display language
ro: Schimbă limba de afișare a aplicației

source: Select Language
ro: Selectează Limba

source: English
ro: Engleză

source: German
ro: Germană

source: Romanian
ro: Română

source: System Default
ro: Implicit Sistem

# themeSettings
source: Appearance
ro: Aspect

# themeSettingsDesc
source: Dark mode, colors and display
ro: Mod întunecat, culori și afișare

source: Select Theme
ro: Selectează Tema

# lightTheme
source: Light
ro: Luminos

# darkTheme
source: Dark
ro: Întunecat

# systemTheme
source: System
ro: Sistem

source: Exit App
ro: Închide Aplicația
